stubs/__files/partner/dgf/OALBereitstellung-ERLM.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal">
    <soapenv:Header/>
    <soapenv:Body>
        <ns2:annehmenMeldungRequest xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal"
                                    xmlns:ns4="http://spri.telekom.de/oss/v5/messageOal"
                                    xmlns:complexOal="http://spri.telekom.de/oss/v5/complexOal">
            <control>
                <zeitstempel>{{now format='yyyy-MM-dd'}}T{{now format='HH:mm:ss.SSS'}}</zeitstempel>
                <majorRelease>04</majorRelease>
                <minorRelease>90</minorRelease>
                <signaturId>
                    <issuer>DTAG</issuer>
                    <serial>123456</serial>
                </signaturId>
            </control>
            <meldung>
                <auftragstyp>
                    <geschaeftsfall>NEU</geschaeftsfall>
                    <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                    <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
                </auftragstyp>
                <meldungstyp xsi:type="ns4:MeldungstypERLMType" xmlns:ns4="http://spri.telekom.de/oss/v5/messageOal"
                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <meldungsattribute>
                        <externeAuftragsnummer>{{soapXPath request.body '/annehmenAuftragRequest/auftrag/externeAuftragsnummer/text()'}}</externeAuftragsnummer>
                        <auftraggebernummer>2020005101</auftraggebernummer>
                        <anschluss xsi:type="complexOal:OalAnschlussType">
                            <schaltangabenNga xsi:type="complexOal:OalSchaltangabenType">
                                <standortBName>POP-Lüdighausen-4711</standortBName>
                                <rack>34-53</rack>
                                <port>0815-23-47</port>
                                <ppid>
                                    {{eq (persist key='dgf_ppid') null yes=(randomValue length=5 type='NUMERIC') no=(persist key='dgf_ppid')}}
                                </ppid>
                            </schaltangabenNga>
                            <homeId>
                                <homeIdNummer>{{randomValue length=8 type='NUMERIC'}}</homeIdNummer>
                            </homeId>
                            <patchService>partner</patchService>
                        </anschluss>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0014</meldungscode>
                            <meldungstext>Montage beim Endkunden mit Ende-zu-Ende-Prüfung erfolgreich ausgeführt
                            </meldungstext>
                        </position>
                    </meldungspositionen>
                </meldungstyp>
            </meldung>
        </ns2:annehmenMeldungRequest>
    </soapenv:Body>
</soapenv:Envelope>
